app/views/users/show.html.erb

      <% @user_reviews.each do |review| %>
        <% if review.rating == Review.maximum('rating') %>
          <% @beer = Beer.find(review.beer_id) %>
          <h6>Based on your choice of <i><%= @beer.name %>:</i></h6>
            <% Beer.all.each do |beer| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT MAX("reviews"."rating") FROM "reviews"
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "beers".* FROM "beers"