app/views/beers/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
---
    <div class="average-review-rating" data-score=<%= @average_review %>></div>
    <span class="number-of-reviews">Based on <%= @beer.reviews.count %> reviews</span>