app/controllers/beers_controller.rb

SELECT "categories".* FROM "categories"
SELECT "beers".* FROM "beers" ORDER BY created_at DESC
SELECT  "beers".* FROM "beers" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Stout"], ["LIMIT", 1]]
SELECT "beers".* FROM "beers" WHERE "beers"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]
---
  def index
    if params[:category].blank?
      @beers = Beer.all.order("created_at DESC")
      @botd = Beer.all.order("RANDOM()").limit(1)
    else
      @category_id = Category.find_by(name: params[:category]).id
      @beers = Beer.where(:category_id => @category_id).order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 9]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
---
  def show
    if @beer.reviews.blank?
      @average_review = 0
    else
      @average_review = @beer.reviews.average(:rating).round(2)

SELECT "categories".* FROM "categories"
---
  def new
    @beer = current_user.beers.build
    @categories = Category.all.map{ |c| [c.name, c.id]}

INSERT INTO "beers" ("name", "description", "style", "ABV", "company", "created_at", "updated_at", "user_id", "category_id", "beer_img_file_name", "beer_img_content_type", "beer_img_file_size", "beer_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @beer = current_user.beers.build(beer_params)
    @beer.category_id = params[:category_id]
    if @beer.save

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "beers" SET "lat" = ?, "long" = ?, "updated_at" = ? WHERE "beers"."id" = ?  [["lat", 26.1744516], ["long", -80.1334616], ["updated_at", "2018-07-31 15:27:04.396035"], ["id", 7]]
---
  def update
      @beer = Beer.find(params[:id])
      @beer.category_id = params[:category_id]
      if @beer.update(beer_params)

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def find_beer
      @beer = Beer.find(params[:id])