app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def search
    if params[:search].present?
      @beers = Beer.search(params[:search])

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def index
    @botd = Beer.find(Review.maximum('rating'))

SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 7]]
---
  def show
    if @beer.reviews.blank?
      @average_review = 0
    else
      @average_review = @beer.reviews.average(:rating).round(2)

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def find_beer
      @beer = Beer.find(params[:id])