app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "beer_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Nice Beer"], ["created_at", "2018-07-26 19:36:16.683491"], ["updated_at", "2018-07-26 19:36:16.683491"], ["user_id", 2], ["beer_id", 7]]
---
  def create
    @review = Review.new(review_params)
    @review.beer_id = @beer.id
    @review.user_id = current_user.id
    if @review.save

UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4], ["updated_at", "2018-08-02 15:07:47.468641"], ["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def update
    if @review.update(review_params)
      @review = Review.find(params[:id])

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def find_beer
      @beer = Beer.find(params[:beer_id])