app/models/beer.rb

SELECT "beers".* FROM "beers" WHERE (lower(beers.name) LIKE '%wood%' OR lower(beers.company) LIKE '%wood%')
---
  def self.search(search)